Frontend/vue.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-11-19 Mon 07:15 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Vue</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Vue</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb4e73bf">1. MVC/MVP/MVVM</a></li>
<li><a href="#org93c1762">2. 示例</a></li>
</ul>
</div>
</nav>


<section id="outline-container-orgb4e73bf" class="outline-2">
<h2 id="orgb4e73bf"><span class="section-number-2">1</span> MVC/MVP/MVVM</h2>
<div class="outline-text-2" id="text-1">
<p>
MVC:
</p>
<ul class="org-ul">
<li>Model</li>
<li>View</li>
<li>Controller</li>
</ul>

<p>
社会上需要有分工，编程分模板。分的目的是为了提高效率，便于维护。
</p>

<p>
这是一种非常自然，也是一种使用最普遍的分层方式。
</p>

<p>
但是 MVC 在实际运用中，往往暴露出一个非常大的问题:
</p>
<ul class="org-ul">
<li>Model/View 相对简单，但是 <b>Controller 太大了，责任太重了</b></li>
<li>Controller 往往会超过几千行代码，里面混杂太多逻辑了</li>
</ul>

<p>
由于存在上述问题，自然就产生了其他的一些解决方案。这些解决方案基本上都是基于 MVC 模式，可以说，他们都是 MVC 模式的变种。
</p>

<p>
比如说，MVP (Most Valuable Player)
</p>

<p>
MVVM:
</p>
<ul class="org-ul">
<li>Model</li>
<li>View</li>
<li>View Model</li>
</ul>

<div class="org-src-container">
<pre class="src src-web">&lt;!-- View --&gt;
&lt;html&gt;
    &lt;table id="xxx"&gt;
    &lt;/table&gt;
&lt;/html&gt;

&lt;script&gt;
 // Model
 $.<span class="org-web-mode-function-call">ajax</span>('/url', {...}).<span class="org-web-mode-function-call">done</span>(doRender);

 // Controller
 <span class="org-web-mode-keyword">function</span> <span class="org-web-mode-function-name">doRender</span>(data) {
     // &#25226; Model &#37324;&#30340;&#30456;&#20851;&#25968;&#25454;&#65292;&#32465;&#23450;&#21040;&#39029;&#38754; View &#30340;&#30456;&#20851;&#20301;&#32622;
     <span class="org-web-mode-keyword">var</span> <span class="org-web-mode-variable-name">node</span> = <span class="org-web-mode-type">$</span>("#xxx");
     <span class="org-web-mode-keyword">var</span> <span class="org-web-mode-variable-name">html</span> = "&lt;tr&gt;" + "data &#25340;&#25509;&#25104; &lt;td&gt; &#36830;&#25509;&#36215;&#26469;&#30340;&#26041;&#24335;" + "&lt;/tr&gt;";
     node.innerHTML = html;
 }
&lt;/script&gt;
</pre>
</div>
</div>
</section>
<section id="outline-container-org93c1762" class="outline-2">
<h2 id="org93c1762"><span class="section-number-2">2</span> 示例</h2>
<div class="outline-text-2" id="text-2">
<p>
指令模板 (View):
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span class="org-function-name">div</span> <span class="org-variable-name">id</span>=<span class="org-string">"app"</span>&gt;
  &lt;<span class="org-function-name">section</span>&gt;
    &lt;<span class="org-function-name">h4</span>&gt;<span class="org-underline">&#36827;&#34892;&#25968;&#25454;&#32465;&#23450;&#65292;&#21028;&#26029;&#12289;&#24490;&#29615;</span>&lt;/<span class="org-function-name">h4</span>&gt;
    &lt;<span class="org-function-name">div</span> <span class="org-variable-name">v-for</span>=<span class="org-string">"person in persons"</span> <span class="org-variable-name">v-if</span>=<span class="org-string">"person.age &gt; 18"</span>&gt;
      &lt;<span class="org-function-name">div</span>&gt;name: {{person.name}}&lt;/<span class="org-function-name">div</span>&gt;
      &lt;<span class="org-function-name">div</span>&gt;age: {{person.age}}&lt;/<span class="org-function-name">div</span>&gt;
      &lt;<span class="org-function-name">div</span>&gt;address: {{person.address}}&lt;/<span class="org-function-name">div</span>&gt;
    &lt;/<span class="org-function-name">div</span>&gt;
  &lt;/<span class="org-function-name">section</span>&gt;

  &lt;<span class="org-function-name">section</span> :style=<span class="org-string">"mystyle"</span> <span class="org-sgml-namespace">v-bind</span>:<span class="org-variable-name">title</span>=<span class="org-string">"mytitle"</span>&gt;
    &lt;<span class="org-function-name">h4</span>&gt;<span class="org-underline">&#36827;&#34892;&#23646;&#24615;&#32465;&#23450;&#65292;&#20107;&#20214;&#30340;&#22768;&#26126;</span>&lt;/<span class="org-function-name">h4</span>&gt;
    &lt;<span class="org-function-name">span</span>&gt;{{message}}&lt;/<span class="org-function-name">span</span>&gt;
    &lt;<span class="org-function-name">button</span> <span class="org-sgml-namespace">v-on</span>:<span class="org-variable-name">click</span>=<span class="org-string">"changeStyle"</span>&gt;&#25913;&#21464;&#39068;&#33394;&lt;/<span class="org-function-name">button</span>&gt;
    &lt;<span class="org-function-name">button</span> @click=<span class="org-string">"reverseMessage"</span>&gt;&#21453;&#21521;&#26174;&#31034;&lt;/<span class="org-function-name">button</span>&gt;
  &lt;/<span class="org-function-name">section</span>&gt;

  &lt;<span class="org-function-name">section</span>&gt;
    &lt;<span class="org-function-name">h4</span>&gt;<span class="org-underline">&#25968;&#25454;&#30340;&#21452;&#21521;&#32465;&#23450;</span>&lt;/<span class="org-function-name">h4</span>&gt;
    &lt;<span class="org-function-name">div</span>&gt;&lt;<span class="org-function-name">input</span> <span class="org-variable-name">v-model.number</span>=<span class="org-string">"firstScore"</span> <span class="org-variable-name">placeholder</span>=<span class="org-string">"&#31532; 1 &#20010;&#20154;&#30340;&#20998;&#25968;"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
    &lt;<span class="org-function-name">div</span>&gt;&lt;<span class="org-function-name">input</span> <span class="org-variable-name">v-model.number</span>=<span class="org-string">"secondScore"</span> <span class="org-variable-name">placeholder</span>=<span class="org-string">"&#31532; 2 &#20010;&#20154;&#30340;&#20998;&#25968;"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
    &lt;<span class="org-function-name">div</span>&gt;&lt;<span class="org-function-name">input</span> <span class="org-variable-name">v-model.number</span>=<span class="org-string">"thirdScore"</span> <span class="org-variable-name">placeholder</span>=<span class="org-string">"&#31532; 3 &#20010;&#20154;&#30340;&#20998;&#25968;"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
    &lt;<span class="org-function-name">div</span>&gt;&#24403;&#21069;&#65292;&#25152;&#26377;&#20154;&#30340;&#24635;&#20998;&#20026;: {{firstScore + secondScore + thirdScore}} &lt;/<span class="org-function-name">div</span>&gt;
    &lt;<span class="org-function-name">button</span> <span class="org-sgml-namespace">v-on</span>:<span class="org-variable-name">click</span>=<span class="org-string">"submit"</span>&gt;&#25552;&#20132;&lt;/<span class="org-function-name">button</span>&gt;
  &lt;/<span class="org-function-name">section</span>&gt;

  &lt;<span class="org-function-name">section</span>&gt;
    &lt;<span class="org-function-name">h4</span>&gt;<span class="org-underline">&#25351;&#20196;&#30340;&#20462;&#39280;&#31526;</span>&lt;/<span class="org-function-name">h4</span>&gt;
    &lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"http://www.baidu.com"</span> @click.prevent=<span class="org-string">"hahaha"</span>&gt;&#30334;&#24230;&lt;/<span class="org-function-name">a</span>&gt;
    &lt;<span class="org-function-name">input</span> @keyup.13=<span class="org-string">"heiheihei"</span>&gt;
  &lt;/<span class="org-function-name">section</span>&gt;

  &lt;<span class="org-function-name">div</span>&gt;
    {{sysmsg1}}
  &lt;/<span class="org-function-name">div</span>&gt;
  &lt;<span class="org-function-name">div</span>&gt;
    {{sysmsg2}}
  &lt;/<span class="org-function-name">div</span>&gt;

  &lt;<span class="org-function-name">table</span>&gt;
    &lt;<span class="org-function-name">tr</span>&gt;
      &lt;<span class="org-function-name">th</span>&gt;&#32534;&#21495;&lt;/<span class="org-function-name">th</span>&gt;
      &lt;<span class="org-function-name">th</span>&gt;&#21517;&#23383;&lt;/<span class="org-function-name">th</span>&gt;
      &lt;<span class="org-function-name">th</span>&gt;&#20215;&#26684;&lt;/<span class="org-function-name">th</span>&gt;
    &lt;/<span class="org-function-name">tr</span>&gt;
    &lt;<span class="org-function-name">tr</span> <span class="org-variable-name">v-for</span>=<span class="org-string">"book in books"</span>&gt;
      &lt;<span class="org-function-name">td</span>&gt;{{ book.id }}&lt;/<span class="org-function-name">td</span>&gt;
      &lt;<span class="org-function-name">td</span>&gt;{{ book.name }}&lt;/<span class="org-function-name">td</span>&gt;
      &lt;<span class="org-function-name">td</span>&gt;{{ book.price }}&lt;/<span class="org-function-name">td</span>&gt;
      &lt;<span class="org-function-name">td</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">""</span> @click.prevent=<span class="org-string">"killMe(book.id)"</span>&gt;&#21024;&#38500;&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">td</span>&gt;
    &lt;/<span class="org-function-name">tr</span>&gt;
  &lt;/<span class="org-function-name">table</span>&gt;
  &lt;<span class="org-function-name">div</span> <span class="org-variable-name">v-if</span>=<span class="org-string">"books.length == 0"</span>&gt;
    &#30446;&#21069;&#27809;&#26377;&#20219;&#20309;&#20070;&#31821;
  &lt;/<span class="org-function-name">div</span>&gt;

  &lt;<span class="org-function-name">div</span> <span class="org-variable-name">style</span>=<span class="org-string">"border: 1px solid grey; border-radius: 5px; padding: 1em;"</span>&gt;
    &lt;<span class="org-function-name">div</span>&gt;&lt;<span class="org-function-name">input</span> <span class="org-variable-name">v-model</span>=<span class="org-string">"book.id"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
    &lt;<span class="org-function-name">div</span>&gt;&lt;<span class="org-function-name">input</span> <span class="org-variable-name">v-model</span>=<span class="org-string">"book.name"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
    &lt;<span class="org-function-name">div</span>&gt;&lt;<span class="org-function-name">input</span> <span class="org-variable-name">v-model</span>=<span class="org-string">"book.price"</span>&gt;&lt;/<span class="org-function-name">div</span>&gt;
  &lt;/<span class="org-function-name">div</span>&gt;
  &lt;<span class="org-function-name">button</span> @click=<span class="org-string">"saveBook"</span>&gt;&#20445;&#23384;&lt;/<span class="org-function-name">button</span>&gt;
&lt;/<span class="org-function-name">div</span>&gt;

</pre>
</div>

<p>
View Model:
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">vm</span> = <span class="org-keyword">new</span> <span class="org-type">Vue</span>({
    el: <span class="org-string">'#app'</span>,
    data: { <span class="org-comment-delimiter">// </span><span class="org-comment">Model</span>
        persons: [],

        message: <span class="org-string">'hello, my friend.'</span>,
        mystyle: <span class="org-string">"color: red"</span>,
        mytitle: <span class="org-string">'&#29616;&#22312;&#26102;&#38388;: '</span> + <span class="org-keyword">new</span> <span class="org-type">Date</span>(),

        firstScore: 100,
        secondScore: 10,
        thirdScore: 220,

        sysmsg2: <span class="org-string">'&#31354;'</span>,
        books: [],
        book: { id: 0, name: <span class="org-string">''</span>, price: 100 }
    },
    watch: {
        <span class="org-function-name">firstScore</span>: <span class="org-keyword">function</span>(<span class="org-variable-name">n</span>, <span class="org-variable-name">o</span>) {
            console.log(<span class="org-string">"skdfjsdk"</span>);
            <span class="org-constant">this</span>.sysmsg2 = <span class="org-string">`&#32769;&#30340; firstScore &#20026; ${o} &#26032;&#30340;&#20026; ${n}`</span>;
        }
    },
    computed: { <span class="org-comment-delimiter">// </span><span class="org-comment">&#36890;&#36807;&#35745;&#31639;&#24471;&#26469;&#30340;&#23646;&#24615;</span>
        <span class="org-function-name">sysmsg1</span>: <span class="org-keyword">function</span> () {
            <span class="org-keyword">if</span> (Math.random() &gt; 0.5) {
                <span class="org-keyword">return</span> <span class="org-constant">this</span>.message + <span class="org-constant">this</span>.thirdScore + <span class="org-keyword">new</span> <span class="org-type">Date</span>();
            } <span class="org-keyword">else</span> {
                <span class="org-keyword">return</span> <span class="org-string">"hello"</span>;
            }
        }
    },
    methods: {
        <span class="org-function-name">changeStyle</span>: <span class="org-keyword">function</span> () {
            <span class="org-keyword">var</span> <span class="org-variable-name">colors</span> = [<span class="org-string">"green"</span>, <span class="org-string">"red"</span>, <span class="org-string">"yellow"</span>, <span class="org-string">"pink"</span>, <span class="org-string">"blue"</span>];
            <span class="org-keyword">var</span> <span class="org-variable-name">randColor</span> = colors[Math.floor((Math.random()*colors.length))];
            <span class="org-constant">this</span>.mystyle = <span class="org-string">"color: "</span> + randColor;
        },
        <span class="org-function-name">reverseMessage</span>: <span class="org-keyword">function</span> () {
            <span class="org-constant">this</span>.message = <span class="org-constant">this</span>.message.split(<span class="org-string">''</span>).reverse().join(<span class="org-string">''</span>);
        },
        <span class="org-function-name">submit</span>: <span class="org-keyword">function</span> () {
            console.log(vm.firstScore);
            console.log(vm.secondScore);
            console.log(vm.thirdScore);
        },
        <span class="org-function-name">hahaha</span>: <span class="org-keyword">function</span> () {
            alert(<span class="org-string">"&#21704;&#21704;&#21704;&#21704;"</span>);
        },
        <span class="org-function-name">heiheihei</span>: <span class="org-keyword">function</span> () {
            alert(<span class="org-string">"&#22079;&#22079;&#22079;: "</span> + event.keyCode);
        },
        <span class="org-function-name">saveBook</span>: <span class="org-keyword">function</span> () {
            <span class="org-constant">this</span>.books.push({
                id: <span class="org-constant">this</span>.book.id,
                name: <span class="org-constant">this</span>.book.name,
                price: <span class="org-constant">this</span>.book.price
            });
            <span class="org-constant">this</span>.book = {};
        },
        <span class="org-function-name">killMe</span>: <span class="org-keyword">function</span> (<span class="org-variable-name">id</span>) {
            <span class="org-constant">this</span>.books = <span class="org-constant">this</span>.books.filter((b) =&gt; b.id != id);
        }
    },
    <span class="org-function-name">created</span>: <span class="org-keyword">function</span> () {
        <span class="org-constant">this</span>.books.push({
            id: 1,
            name: <span class="org-string">'ssss'</span>,
            price: 232
        });
    },
    <span class="org-function-name">mounted</span>: <span class="org-keyword">function</span> () {
        console.log(<span class="org-string">"&#29616;&#22312;&#65292;&#25152;&#26377;&#30340;&#24037;&#20316;&#37117;&#20934;&#22791;&#23601;&#32490;&#20102;!!"</span>);
    }
});


<span class="org-keyword">function</span> <span class="org-function-name">xxx</span> () {
    event.preventDefault();
    alert(<span class="org-string">'&#39575;&#20320;&#30340;'</span>);
}
</pre>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2018-11-19 Mon 07:15</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
